mongoLoad.txt
DBFactory: site.ycsb.db.MongoDbClient
mongo client connection created with mongodb://localhost:27017/grafittiDB?w=1



***** here is in load phase? 10.0
$$$$$I am going to insert
Key : 5891 Query Result :{"_id": {"$oid": "5f87ea31f5dc057dc01925cc"}, "type": "Feature", "properties": {"OBJECTID": 13079, "INCIDENT_NUMBER": "1/25/2019-PC-13078", "LOCATION": "Bridges", "NOTIFICATION": "Proactive Graffiti", "INCIDENT_DATE": "2019-01-25T15:44:45.000Z", "TAG_COUNT": 3, "MONIKER_CLASS": "General", "SQ_FT": 40, "PROP_TYPE": "City", "Waiver": null}, "geometry": {"type": "Point", "coordinates": [-111.9093478524001, 33.4331325614709]}}

10.0    -1 documents to be inserted........



***** here is in load phase? 10.0
$$$$$I am going to insert
Key : 5829 Query Result :{"_id": {"$oid": "5f87ea31f5dc057dc01913cd"}, "type": "Feature", "properties": {"OBJECTID": 8474, "INCIDENT_NUMBER": "8/10/2017-PC-8476", "LOCATION": "Traffic Mast", "NOTIFICATION": "Proactive Graffiti", "INCIDENT_DATE": "2017-08-10T16:28:49.000Z", "TAG_COUNT": 1, "MONIKER_CLASS": "General", "SQ_FT": 4, "PROP_TYPE": "City", "Waiver": null}, "geometry": {"type": "Point", "coordinates": [-111.89264587251775, 33.37823217288523]}}

10.0    -1 documents to be inserted........



***** here is in load phase? 10.0
$$$$$I am going to insert
Key : 448 Query Result :{"_id": {"$oid": "5f87ea31f5dc057dc0191810"}, "type": "Feature", "properties": {"OBJECTID": 9564, "INCIDENT_NUMBER": "11/14/2017-EC-9563", "LOCATION": "Secondary Abatement", "NOTIFICATION": "Proactive Graffiti", "INCIDENT_DATE": "2017-11-14T19:40:42.000Z", "TAG_COUNT": 0, "MONIKER_CLASS": "Maintenance", "SQ_FT": 100, "PROP_TYPE": "City", "Waiver": null}, "geometry": {"type": "Point", "coordinates": [-111.94184266698551, 33.43394733760139]}}

10.0    -1 documents to be inserted........



***** here is in load phase? 10.0
$$$$$I am going to insert
Key : 1 Query Result :{"_id": {"$oid": "5f87ea31f5dc057dc01906d5"}, "type": "Feature", "properties": {"OBJECTID": 5154, "INCIDENT_NUMBER": "1/24/2017-EC-5162", "LOCATION": "ROW", "NOTIFICATION": "Maintenance", "INCIDENT_DATE": "2017-01-24T19:18:48.000Z", "TAG_COUNT": 0, "MONIKER_CLASS": "Maintenance", "SQ_FT": 200, "PROP_TYPE": "Residential", "Waiver": null}, "geometry": {"type": "Point", "coordinates": [-111.95877119618005, 33.42536199844341]}}

10.0    -1 documents to be inserted........



***** here is in load phase? 10.0
$$$$$I am going to insert
Key : 1761 Query Result :{"_id": {"$oid": "5f87ea31f5dc057dc0191c4e"}, "type": "Feature", "properties": {"OBJECTID": 10650, "INCIDENT_NUMBER": "3/20/2018-EC-10654", "LOCATION": "Secondary Abatement", "NOTIFICATION": "Proactive Graffiti", "INCIDENT_DATE": "2018-03-20T19:16:44.000Z", "TAG_COUNT": 0, "MONIKER_CLASS": "Maintenance", "SQ_FT": 40, "PROP_TYPE": "Utilities", "Waiver": null}, "geometry": {"type": "Point", "coordinates": [-111.94379290200108, 33.43175516541138]}}

10.0    -1 documents to be inserted........



***** here is in load phase? 10.0
$$$$$I am going to insert
Key : 1522 Query Result :{"_id": {"$oid": "5f87ea32f5dc057dc01929d2"}, "type": "Feature", "properties": {"OBJECTID": 11762, "INCIDENT_NUMBER": "8/10/2018-PC-11761", "LOCATION": "Bus Stop", "NOTIFICATION": "ACR Main", "INCIDENT_DATE": "2018-08-10T14:33:37.000Z", "TAG_COUNT": 4, "MONIKER_CLASS": "General", "SQ_FT": 10, "PROP_TYPE": "City", "Waiver": null}, "geometry": {"type": "Point", "coordinates": [-111.93925183718966, 33.380863202769596]}}

10.0    -1 documents to be inserted........



***** here is in load phase? 10.0
$$$$$I am going to insert
Key : 10776 Query Result :{"_id": {"$oid": "5f87ea31f5dc057dc0190b21"}, "type": "Feature", "properties": {"OBJECTID": 6254, "INCIDENT_NUMBER": "4/12/2017-PC-6251", "LOCATION": "ROW", "NOTIFICATION": "Proactive Graffiti", "INCIDENT_DATE": "2017-04-12T21:22:33.000Z", "TAG_COUNT": 12, "MONIKER_CLASS": "General", "SQ_FT": 8, "PROP_TYPE": "Utilities", "Waiver": null}, "geometry": {"type": "Point", "coordinates": [-111.94380874764279, 33.431714549174686]}}

10.0    -1 documents to be inserted........



***** here is in load phase? 10.0
$$$$$I am going to insert
Key : 4956 Query Result :{"_id": {"$oid": "5f87ea31f5dc057dc0192785"}, "type": "Feature", "properties": {"OBJECTID": 11174, "INCIDENT_NUMBER": "5/14/2018-EC-11173", "LOCATION": " ", "NOTIFICATION": " ", "INCIDENT_DATE": "2018-05-14T15:22:00.000Z", "TAG_COUNT": 0, "MONIKER_CLASS": " ", "SQ_FT": 0, "PROP_TYPE": " ", "Waiver": null}, "geometry": {"type": "Point", "coordinates": [-111.92063513058345, 33.41995219652185]}}

10.0    -1 documents to be inserted........



***** here is in load phase? 10.0
$$$$$I am going to insert
Key : 3089 Query Result :{"_id": {"$oid": "5f87ea31f5dc057dc019070a"}, "type": "Feature", "properties": {"OBJECTID": 5207, "INCIDENT_NUMBER": "1/25/2017-PC-5172", "LOCATION": "Parks", "NOTIFICATION": "Proactive Graffiti", "INCIDENT_DATE": "2017-01-25T14:42:24.000Z", "TAG_COUNT": 8, "MONIKER_CLASS": "Explicit", "SQ_FT": 4, "PROP_TYPE": "City", "Waiver": null}, "geometry": {"type": "Point", "coordinates": [-111.90224350237636, 33.41769044053455]}}

10.0    -1 documents to be inserted........



***** here is in load phase? 10.0
$$$$$I am going to insert
Key : 12477 Query Result :{"_id": {"$oid": "5f87ea31f5dc057dc0191ecc"}, "type": "Feature", "properties": {"OBJECTID": 2289, "INCIDENT_NUMBER": "6/3/2016-PC-2288", "LOCATION": "Water", "NOTIFICATION": "Proactive Graffiti", "INCIDENT_DATE": "2016-06-03T14:08:11.000Z", "TAG_COUNT": 2, "MONIKER_CLASS": "General", "SQ_FT": 0, "PROP_TYPE": "City", "Waiver": null}, "geometry": {"type": "Point", "coordinates": [-111.93083725271369, 33.43362444811941]}}

10.0    -1 documents to be inserted........
[OVERALL], RunTime(ms), 1201
[OVERALL], Throughput(ops/sec), 8.32639467110741
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 9
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.7493755203996669
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 9
[TOTAL_GC_TIME_%], Time(%), 0.7493755203996669
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3141.0
[CLEANUP], MinLatency(us), 3140
[CLEANUP], MaxLatency(us), 3141
[CLEANUP], 95thPercentileLatency(us), 3141
[CLEANUP], 99thPercentileLatency(us), 3141
[GEO_LOAD], Operations, 10
[GEO_LOAD], AverageLatency(us), 34873.2
[GEO_LOAD], MinLatency(us), 8816
[GEO_LOAD], MaxLatency(us), 220287
[GEO_LOAD], 95thPercentileLatency(us), 220287
[GEO_LOAD], 99thPercentileLatency(us), 220287
[GEO_LOAD], Return=OK, 10